sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
/**@brief Function to initialize the sensors' power supplies ports.
 *
 *
 * @details Set up supply ports to output and to low
 */
static void supplies_init(void)
{
	NRF_LOG_INFO("Preparing supply ports as outputs\r\n");
	nrf_gpio_cfg_output(SMS_PRESSURE_SUPPLY_PIN);
	nrf_gpio_pin_write(SMS_PRESSURE_SUPPLY_PIN, SMS_PRESSURE_SW_OFF);
	nrf_gpio_cfg_output(SMS_IMU_SUPPLY_PIN);
	nrf_gpio_pin_write(SMS_IMU_SUPPLY_PIN, SMS_IMU_SW_OFF);
}

/**@brief Function to initialize the sensors' power supplies ports.
 *
 *
 * @details Set up supply ports to output and to low
 */
static void batgauge_init(void)
{
	NRF_LOG_INFO("Preparing AIN0 as battery level input\r\n");
	ret_code_t err_code;
	nrf_saadc_channel_config_t channel_config =
		NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN0);
	
	err_code = nrf_drv_saadc_init(NULL, batgauge_event_handler);
	APP_ERROR_CHECK(err_code);
	
	err_code = nrf_drv_saadc_channel_init(0, &channel_config);
	APP_ERROR_CHECK(err_code);
	
	err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[0], SAMPLES_IN_BUFFER);
	APP_ERROR_CHECK(err_code);
	
	err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1], SAMPLES_IN_BUFFER);
	APP_ERROR_CHECK(err_code);
}


//void batgauge_event_init(void)
//{
//	NRF_LOG_INFO("Initialize batgauge event ");
//	ret_code_t err_code;
//	err_code = nrf_drv_ppi_init();
//	APP_ERROR_CHECK(err_code);
//	
//	nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
//	timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;
//	err_code = nrf_drv_timer_init(&m_timer, &timer_cfg, gauge_timer_handler);
//	APP_ERROR_CHECK(err_code);
//	
//	/* setup m_timer for compare event every 1000 ms */
//	uint32_t ticks = nrf_drv_timer_ms_to_ticks(&m_timer, 1000);
//	nrf_drv_timer_extended_compare(&m_timer,
//									NRF_TIMER_CC_CHANNEL0,
//									ticks,
//									NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK,
//									false);
//	nrf_drv_timer_enable(&m_timer);
//	
//	uint32_t timer_compare_event_addr = nrf_drv_timer_compare_event_address_get(&m_timer, NRF_TIMER_CC_CHANNEL0);
//	uint32_t saadc_sample_task_addr = nrf_drv_saadc_sample_task_get();
//	
//	/* setup ppi channel so that timer compare event is triggering sample task in SAADC */
//	err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
//	APP_ERROR_CHECK(err_code);
//	err_code = nrf_drv_ppi_channel_assign(m_ppi_channel, timer_compare_event_addr, saadc_sample_task_addr);
//}

/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    uint32_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON1_PIN, false, BUTTON_PULL, button_event_handler},
		{LEDBUTTON_BUTTON2_PIN, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}

static void spi_init(void)
{
	nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
	spi_config.ss_pin = SPI_SS_PIN;
	spi_config.miso_pin = SPI_MISO_PIN;
	spi_config.mosi_pin = SPI_MOSI_PIN;
	spi_config.sck_pin = SPI_SCK_PIN;
	spi_config.mode = NRF_DRV_SPI_MODE_0;
	spi_config.frequency = NRF_DRV_SPI_FREQ_500K;
	APP_ERROR_CHECK(nrf_drv_spi_init(&spi_master_instance, &spi_config, spi_event_handler));
}

/**@brief Function for initializing the TWI module.
 */
void twi_init(void)
{
	ret_code_t err_code;
	const nrf_drv_twi_config_t twi_config = {
		.scl				= TWI_SCL_PIN,
		.sda				= TWI_SDA_PIN,
//		.frequency			= NRF_TWI_FREQ_100K,
		.frequency			= NRF_TWI_FREQ_400K,
		.interrupt_priority = APP_IRQ_PRIORITY_HIGH,
		.clear_bus_init		= false
		};
	
		err_code = nrf_drv_twi_init(&twi_master_instance, &twi_config, twi_event_handler, NULL);
		APP_ERROR_CHECK(err_code);
		
		nrf_drv_twi_enable(&twi_master_instance);
}

// Drivers
/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
	uint32_t err_code;

    // Initialize application timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
	
	// Create timers
	err_code = app_timer_create(&pressure_poll_int_id,
								APP_TIMER_MODE_REPEATED,
								pressure_poll_int_handler);
	APP_ERROR_CHECK(err_code);

	err_code = app_timer_create(&imu_poll_int_id,
								APP_TIMER_MODE_REPEATED,
								imu_poll_int_handler);
	APP_ERROR_CHECK(err_code);
	
	err_code = app_timer_create(&button_press_timer_id,
								APP_TIMER_MODE_SINGLE_SHOT,
								button_press_timeout_handler);
	APP_ERROR_CHECK(err_code);
	
	err_code = app_timer_create(&saadc_timer_id,
								APP_TIMER_MODE_REPEATED,
								saadc_timer_handler);
	APP_ERROR_CHECK(err_code);
	
//	// Initialize the timer driver to count microseconds
//	nrf_drv_timer_config_t timer_config = NRF_DRV_TIMER_DEFAULT_CONFIG;
//	timer_config.frequency = NRF_TIMER_FREQ_1MHz;
//	err_code = nrf_drv_timer_init(&TIMER_DELTA_US, &timer_config, timer_delta_us_handler);
//	APP_ERROR_CHECK(err_code);
}

static void bootloader_start(uint16_t conn_handle)
{
	uint32_t err_code;
	
	/* Force disconnect, disable softdevice, and then reset */
	sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	// The below requires at least bootloader 3.1
	err_code = sd_power_gpregret_set(BOOTLOADER_DFU_START, 0x000000FF);
	APP_ERROR_CHECK(err_code);
	
	sd_softdevice_disable();
	
	nrf_delay_us(500 * 1000);
	
	//reset system to start the bootloader
	NVIC_SystemReset();
}

	


// BLE
/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);

    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
    ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Subscribe for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}

