sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
}


/* ====================================================================
 * RUN-TIME FUNCTIONS
 * --------------------------------------------------------------------
 *
 * ==================================================================== */
//static void timers_create(void)
//{
//	uint32_t err_code;
//	err_code = app_timer_create(&pressure_poll_int_id,
//								APP_TIMER_MODE_REPEATED,
//								pressure_poll_int_handler);
//	APP_ERROR_CHECK(err_code);

//	err_code = app_timer_create(&imu_poll_int_id,
//								APP_TIMER_MODE_REPEATED,
//								imu_poll_int_handler);
//	APP_ERROR_CHECK(err_code);
//	
//	err_code = app_timer_create(&button_press_timer_id,
//								APP_TIMER_MODE_SINGLE_SHOT,
//								button_press_timeout_handler);
//	APP_ERROR_CHECK(err_code);
//	
//	err_code = app_timer_create(&saadc_timer_id,
//								APP_TIMER_MODE_REPEATED,
//								saadc_timer_handler);
//	APP_ERROR_CHECK(err_code);
//}


/**@brief Function for the Power Manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}


void sensors_start(void)
{
	NRF_LOG_INFO("Starting sensors...\n\r");
	NRF_LOG_INFO("...switch on supply\n\r");
	nrf_gpio_pin_write(SMS_PRESSURE_SUPPLY_PIN, 1);
	nrf_gpio_pin_write(SMS_IMU_SUPPLY_PIN, 1);
	
	NRF_LOG_INFO("...enable & initialize: ");
	pressure_enable();
	NRF_LOG_INFO("MS58? %d,", ms58_config.dev_en);
	imu_enable();
	NRF_LOG_INFO("BNO055? %d\r\n", bno055_config.dev_en);
	
//	NRF_LOG_INFO("...timers\n\r");
//	app_timer_start(pressure_poll_int_id,
//					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_PRESSURE_POLL_MS, UNIT_1_00_MS), 0),
//					NULL);
//	app_timer_start(imu_poll_int_id,
//					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_IMU_POLL_MS, UNIT_1_00_MS), 0),
//					NULL);
////	nrf_drv_timer_enable(&TIMER_DELTA_US);
//	
//	ms58_interrupt.enabled = true;
//	bno055_interrupt.enabled = true;
}

void sensors_stop(void)
{
	NRF_LOG_INFO("Stopping sensors...\n\r");
	NRF_LOG_INFO("...switch off supply\n\r");
	nrf_gpio_pin_write(SMS_PRESSURE_SUPPLY_PIN, SMS_PRESSURE_SW_OFF);
	nrf_gpio_pin_write(SMS_IMU_SUPPLY_PIN, SMS_IMU_SW_OFF);
	
	NRF_LOG_INFO("...polling timers\n\r");
	app_timer_stop(pressure_poll_int_id);
	app_timer_stop(imu_poll_int_id);
	
	ms58_interrupt.enabled = false;
	bno055_interrupt.enabled = false;
}

void button_press_timer_start(void)
{
	app_timer_start(button_press_timer_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BUTTON_LONG_PRESS_MS, UNIT_1_00_MS), 0),
					NULL);
}

//void batgauge_event_enable(void)
//{
//	NRF_LOG_INFO("Enable batgauge event\r\n");
////	ret_code_t err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);
////	APP_ERROR_CHECK(err_code);
//}

/* ====================================================================
 * MAIN
 * ==================================================================== */
/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t err_code;
    
    // Setup log
	err_code = NRF_LOG_INIT(NULL);
	APP_ERROR_CHECK(err_code);
	uint8_t fw_msb, fw_lsb;
	fw_msb = ((SMS_VERSION_ID & 0xFF) > 8);
	fw_lsb = (SMS_VERSION_ID & 0x0F);
	NRF_LOG_INFO("===============================\n\r");
	NRF_LOG_INFO("SMS sensors firmware v%d.%d, r%03d\n\r", fw_msb, fw_lsb, SMS_RELEASE_ID);
	NRF_LOG_INFO("===============================\n\n\r");

	// Initialize hardware & services
	NRF_LOG_INFO("Initializing hardware...\n\r");
    leds_init();
    timers_init();
	supplies_init();
    buttons_init();
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

	spi_init();
	twi_init();
	batgauge_init();
	
//	// Instantiate
//	timers_create();
	
	// Initialize & configure peripherals
	pressure_enable();
	imu_enable();
	ms58_config.dev_start = false;
	bno055_config.dev_start = false;
    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
		
	// Start advertising
	advertising_start();
	
	// Enable battery gauge measurement
	batgauge_start();

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
		
		if(ms58_config.dev_start)
		{
			NRF_LOG_INFO("Starting MS58...\n\r");
			NRF_LOG_INFO("...switch on supply\n\r");
			nrf_gpio_pin_write(SMS_PRESSURE_SUPPLY_PIN, SMS_PRESSURE_SW_ON);
	
			NRF_LOG_INFO("...enable & initialize\n\r");
			pressure_enable();
			NRF_LOG_INFO("MS58? %d\r\n", ms58_config.dev_en);
	
			NRF_LOG_INFO("...timer\n\r");
			app_timer_start(pressure_poll_int_id,
							APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_PRESSURE_POLL_MS, UNIT_1_00_MS), 0),
							NULL);
	
			ms58_interrupt.enabled = ms58_config.dev_en;
			ms58_config.dev_start = false;
		}
		
		if(bno055_config.dev_start)
		{
			NRF_LOG_INFO("Starting BNO055...\n\r");
			NRF_LOG_INFO("...switch on supply\n\r");
			nrf_gpio_pin_write(SMS_IMU_SUPPLY_PIN, SMS_IMU_SW_ON);
	
			NRF_LOG_INFO("...enable & initialize\n\r");
			imu_enable();
			NRF_LOG_INFO("BNO055? %d\r\n", bno055_config.dev_en);
	
			NRF_LOG_INFO("...timer\n\r");
			app_timer_start(imu_poll_int_id,
							APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_IMU_POLL_MS, UNIT_1_00_MS), 0),
							NULL);

			bno055_interrupt.enabled = bno055_config.dev_en;
			bno055_config.dev_start = false;
		}
		
		if((ms58_interrupt.enabled) && (ms58_interrupt.new_value))
		{
			nrf_gpio_pin_write(DBG1_PIN, 1);
			
			ms58_interrupt.new_value = false;
			pressure_poll_data();
			
			nrf_gpio_pin_write(DBG1_PIN, 0);
		}
		
		if((bno055_interrupt.enabled) && (bno055_interrupt.new_value))
		{
			nrf_gpio_pin_write(DBG2_PIN, 1);

			bno055_interrupt.new_value = false;
			imu_poll_data(SMS_IMU_DATAMSK_QUAT);
			NRF_LOG_DEBUG("Quat: %d %d %d %d\n\r",
						(int32_t)(bno055_output.quat[0].val * 1000000),
						(int32_t)(bno055_output.quat[1].val * 1000000),
						(int32_t)(bno055_output.quat[2].val * 1000000),
						(int32_t)(bno055_output.quat[3].val * 1000000));
//			bno055_interrupt.rts = true;
			
			nrf_gpio_pin_write(DBG2_PIN, 0);
		}
		
		if(batgauge_new_value)
		{
			bsp_board_led_invert(BSP_BOARD_LED_0);
			batgauge_new_value = false;
			uint32_t err_code;
			uint8_t i;
			uint32_t sum = 0;
			uint32_t avg = 0;
			for(i = 0; i < SAMPLES_IN_BUFFER; i++) {
				sum += m_buffer_pool[0][i];
			}
			avg = sum / SAMPLES_IN_BUFFER;
			NRF_LOG_INFO("Batgauge avg: %d (sum: %d)\n\r", avg, sum);
			err_code = ble_bas_battery_level_update(&m_bas, (uint8_t)avg);
			if ((err_code != NRF_SUCCESS) &&
				(err_code != NRF_ERROR_INVALID_STATE) &&
				(err_code != BLE_ERROR_NO_TX_PACKETS) &&
				(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
			   )
			{
				APP_ERROR_HANDLER(err_code);
			}
		}
		
		if((ms58_interrupt.enabled) && (ms58_interrupt.rts))
		{
			nrf_gpio_pin_write(DBG1_PIN, 1);
			
			ms58_interrupt.rts = false;
			int32_t * tosend;
			tosend = &ms58_output.pressure;
		    bsp_board_led_on(SENDING_LED_PIN);
			err_code = ble_smss_on_press_value(&m_smss_service, tosend);
			bsp_board_led_off(SENDING_LED_PIN);
			if(	(err_code != 0x3401) &&
				(err_code != 0x0008) &&
				(err_code != 0) )
			{
				APP_ERROR_CHECK(err_code);
			}
			
			nrf_gpio_pin_write(DBG1_PIN, 0);
		}
		if((bno055_interrupt.enabled) && (bno055_interrupt.rts))
		{
			nrf_gpio_pin_write(DBG2_PIN, 1);
			
			bno055_interrupt.rts = false;
			uint32_t * tosend;
			tosend = (uint32_t*)&bno055_output.quat[0].b;
		    bsp_board_led_on(SENDING_LED_PIN);
			err_code = ble_smss_on_imu_value(&m_smss_service, tosend);
		    bsp_board_led_off(SENDING_LED_PIN);
			if(	(err_code != 0x3401) &&
				(err_code != 0x0008) &&
				(err_code != 0) )
			{
				APP_ERROR_CHECK(err_code);
			}
			
			nrf_gpio_pin_write(DBG2_PIN, 0);
		}
    }
}


/**
 * @}
 */
